{"pageProps":{"exps":[{"company":"Mayo","title":"Senior Engineer","during":{"start":"2021-09-01T00:00:00.000Z","end":null},"content":"\n## Specification by example\n\nThe company has many customized projects by customer.\nThese customized projects will be brought back to the company and the PM team for specification confirmation after the company's consultant team connects with customers and interviews with customers.\nThe PM is writing the specification according to the requirements provided by the consultant,\nthe development team is writing the program according to the specification provided by the PM, and the quality manager is also writing the test case test according to the specification.\n\nFrom the consultant team to the PM team, and from the PM team to the RD and QA, there are often many information missing in the middle of the referral, which leads to the development of projects that are different from what customers really want.\nIt is often the case that after the developed custom requirements are delivered to the customer, because the usage situation does not match the developed function, it will return to the RD team for redevelopment, and even develop a system completely different from the customer's needs.\n\nRD, PM, and QA within the team have different cognitions of requirements, so there are also cases where test cases conflict with each other, which seriously delays the entire test schedule and development schedule, and customer complaints and customer terminations are staged!\nIn view of this, the team adopts the simple SBE (Specification by example) method first, and QA and RD discuss the actual cases related to specification writing, and finally confirm the specification with PM.\nDuring RD development, use these cases to write unit test development requirements, and after RD is delivered, QA will test against some situational cases. Make the whole team have a clear consensus and understanding of the requirements. Reduce development cycle and test time.\n\n## Knowledge Sharing\n\n1. Frontend architecture optimization and cost saving: After new company go to live,\nour system will be loading heavy and slow down, cause system crashes.\nSo my advice frontend use Azure blob storage and use CDN to accelerate page loading\n\n1. We every season will regularly commission external weakness scans,\nWhen a weakness occurs in the weakness scan, there will be a time limit to deal with it.\nAs long as there is a front-end weakness, I will participate in the discussion of the solution.\n\n1. internal sharing： .net Garbage Collection\n"},{"company":"Glaibo Digital co., Ltd","title":"Senior engineer","during":{"start":"2018-11-01T00:00:00.000Z","end":"2021-04-01T00:00:00.000Z"},"content":"\n##\nPlanning the front-end new official website architecture\n\nIn the middle of 2020, the business team proposed an upgrade and revision plan for the official website,\nredesigning the original website style. Due to the difficulty of upgrading the npm package of the system at that time and the huge difference between the ReactJS version and the mainstream version,\nAfter team discussion, I plan to re-plan and develop a new official website. In the scope of the entire new official website, I am responsible for the following projects\n\n- Lead system development\n- Adjust the way of using GraphQL, so that the data required by the page can be retrieved at one time to reduce the rendering time of the page\n- The design of the project structure allows Component to be reused in the desktop version and the mobile version to the maximum extent.\n- Because the existing website must be rebuilt in each environment, I made some changes in the new website so that one build can be deployed in multiple environments.\n- Solve the problem that the original website needs to maintain the routing table. In the new official website, the routing design is simplified and the logic corresponding to the routing is removed to make the logic of the entire system clearer.\n- The cash flow center of the existing website is another platform that is split out only for the common cash flow logic, so I propose to package the logic of the gold flow center into an npm package, and introduce it into the brand maintained by npm\n- Adopted functional component and used React Hooks\n\n## Plan the AWS architecture and relocate the IDC to AWS\n\nThe company originally used a self-built IDC migrate to AWS under the consideration of various parties. In the original team's plan, a large number of EC2 instances were used to relocate the existing system.\nThe cost of using large of number EC2 instance is very high, so during the relocation process, we made a series of changes to the characteristics of the cloud and the application environment, which saved us nearly 50% of the cost\n\n- The OS operating system is changed, and the Application other than the .net framework is converted to use the Linux system and deployed by container\n- Fully automated expansion and deployment, complete the system environment setting and Application deployment in a very short time without manual, saving a lot of capacity expenditures for building images\n- The test environment and CI Agent will be automatically shutdown and destroyed after the end of each workday, and will be automatically started before going to work the next day, reducing 50% off cost on AWS testing environment\n- An environment with a release preview version can be used for pre-launch checks, and it let service to \"warm up\" and provide real-time online traffic\n- Blue-green deployment and canary deployment\n- Our cloud planning can deploy any version to any environment\n\n## Build a team CI/CD process\n\nThe team did not have a reliable and stable CI and CD process at the beginning, often due to errors in deployment scripts and execution errors that required a large number of manual interventions or confusion in deployment versions, resulting in poor system stability.\nTherefore, I use [dotnet cake](https://cakebuild.net/) in the team to write the entire CI script, and plan a unified git commit message so that the artifact has a reliable version number,\nArtifact Server is also established, so that the entire Artifact has a complete management and storage location\n\nIn the CD part, I used Ansible as the script for team deployment, which improved the problem of manual intervention when deployment failed in the past, and ensured the stability and reliability of deployment to the greatest extent.\nIt also shortened the entire deployment time from 15 minutes to 3 minutes.\n\n\n## Build AWS Infrastructure as Code\n\nThe original setting of AWS relies on a lot of manual and experience setting. When setting up the environment, often because a certain option is not set, the entire service does not perform as expected.\nSo we adopted Terraform, through fixed scripts and parameter files, so that the entire AWS environment can be built more efficiently and accurately. When the environment needs to be changed, it only needs to be modified and stored in gitlab\nChanges to the AWS environment can be completed by setting the settings and handing them over to the team for review.\n\nWhen there is a major update on the AP part, we will use the canary deployment method for system testing, and the canary deployment is very troublesome for AWS settings.\nAs long as you make a mistake, the entire system will have abnormal behavior. Since we have adopted IaC, another benefit is that the cumbersome settings of `canary deployment` can also be simplified and quickly modified.\nAnd you can make changes to Production only after passing through the relevant test environment\n\n## Log collection systems and analysis tools\n\nWhile migrating to the cloud, I used ELK as a log collection and analysis tool. Using an r5.large machine, the system response only needs less than 2ms delay time at the level of 1800 logs per second.\nAnd the production log is automatically saved for 4 weeks, the test environment log is automatically saved for two weeks, and the response level of the log query does not exceed 30 seconds\n\n## Other achievements\n\n- Assist QA in setting up the infra of automated testing, and link the Job deployed by Jenkins to automatically trigger QA's Selenium testing\n- Import new technologies Terraform, Ansible, dotnet core, redis, docker into the team\n"},{"company":"Xuenn Private Limited","title":"IT Consultant","during":{"start":"2015-10-1","end":"2018-09-1"},"content":"\n## Lead 5 people to complete the development of Beijing racing game\n\nDuring my time at Xuenn, I led the teams of QA, DBA, Frontend and Backend to develop the new digital betting game `Beijing Racing Car` within 4 months.\nThe development process of this team adopts an agile development method. We will review the entire backlog before each Sprint starts.\nAnd will come up with a certain amount of backlog to discuss DoD and list the items tested and adopt the BDD development mode,\nIn this project, I played the role of guidance and the assistant of the team so that the whole team has the maximum autonomy in the development process.\n\n## Implementation and tuning of In-Memory's high-concurrency transaction system\n\nIf the use of the database to calculate the betting risk and odds optimization cannot meet the market's betting expectations for the game (20K per second), so the team tried to use the In-Memory trading system.\nAt the beginning, this trading system can carry a trading volume of about 2000~3000 sheets per second, which is quite far from the market's expectations. Therefore, I worked with the TA team to study,\nIn this process, I tried to rewrite the entire program code, rewrite and adjust the program code for the behavior of GC, use the struct method to reduce the number of GC recycling, optimize the calculation process, and finally achieve a single transaction betting volume of `120,000` The number of bets per second.\n\n## Other achievements\n\n- Refactor the old system and import unit tests, the test coverage rate reaches 60%\n- Participate in the DevOps project, participate in the System Configuration group and conduct research on Ansible and Azure DevOps\n- Team release flow planning\n"},{"company":"XIANG SHANG GAMES","title":"Intern","during":{"start":"2014-02-1","end":"2014-09-1"},"content":"\n## Implement and design backend systems and training\n\nThe main reason why I entered the upward game was that the upward game wanted to use the ASP.NET MVC framework to replace the existing ASP.NET.\nAt that time, the Microsoft Most Valuable Expert who was also selected for ASP.NET was good at the MVC framework.\nMy first project is to use MVC to plan the structure of background modules and background.\n\nBecause the upward game wants to import MVC, I have done many MVC training courses in the company, so that the whole department can get started with the ASP.NET MVC framework faster.\n"},{"company":"National Taichung University of Science and Technology - Information management","title":"bachelor","during":{"start":"2010-09-01T00:00:00.000Z","end":"2014-09-01T00:00:00.000Z"},"content":"\n## Microsoft Most Value Professional(MVP)\n\n\nIn the third year of university, I started my admiration for MVP because I participated in the community star activity hosted by Microsoft. During the whole third year of university, I wrote many articles about ASP.NET MVC\nand share my development experience on APS.NET MVC and SSRS skills sharing in Study4.TW, so I won the title of MVP in the fourth year of university and was selected as the youngest MVP of the year.\n\nIn the fourth year of college, he continued to share related technologies and write blog articles to win the re-election of MVP, but was interrupted because he could not continue to share when he was a soldier.\n\n## Third place in Microsoft's first Community Star Competition\n\nI got the content of this competition when I was in my third year of university,\nand I joined a team with my friends to participate in this three-month online and offline community sharing, and finally won the third place.\n\n## Microsoft's 2nd Community Star Coach\n\nThe second community star of the following year has been elected as the MVP, so he was selected as a coach to lead the juniors and guide the members in the difficulties encountered in the game and provide technical support.\n"}]},"__N_SSG":true}